import React from 'react';

const CalculatorSvg = () => (
  <svg viewBox="0 0 16 16" width="16px" height="16px">
    <g id="icon/16/Calculator" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <rect
        id="矩形"
        stroke="currentColor"
        fillRule="nonzero"
        x="0.5"
        y="1.5"
        width="15"
        height="14"
        rx="2"
      ></rect>
      <path
        d="M4,0.5 C4,0.223857625 4.22385763,0 4.5,0 C4.77614237,0 5,0.223857625 5,0.5 L5,2.75 C5,3.02614237 4.77614237,3.25 4.5,3.25 C4.22385763,3.25 4,3.02614237 4,2.75 L4,0.5 Z M8,0.5 C8,0.223857625 8.22385763,0 8.5,0 C8.77614237,0 9,0.223857625 9,0.5 L9,2.75 C9,3.02614237 8.77614237,3.25 8.5,3.25 C8.22385763,3.25 8,3.02614237 8,2.75 L8,0.5 Z M12,0.5 C12,0.223857625 12.2238576,0 12.5,0 C12.7761424,0 13,0.223857625 13,0.5 L13,2.75 C13,3.02614237 12.7761424,3.25 12.5,3.25 C12.2238576,3.25 12,3.02614237 12,2.75 L12,0.5 Z"
        id="合并形状"
        fill="currentColor"
        fillRule="nonzero"
      ></path>
      <text
        id="#"
        fontFamily="PingFangSC-Medium, PingFang SC"
        fontSize="9"
        fontWeight="400"
        fill="currentColor"
      >
        <tspan x="5.3" y="12">
          #
        </tspan>
      </text>
    </g>
  </svg>
);

const CalendarSvg = () => (
  <svg width="16px" height="16px" viewBox="0 0 16 16">
    <g id="icon/16/Calendar" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <rect
        id="矩形"
        stroke="currentColor"
        fillRule="nonzero"
        x="0.5"
        y="1.5"
        width="15"
        height="14"
        rx="2"
      ></rect>
      <path
        d="M4,0.5 C4,0.223857625 4.22385763,0 4.5,0 C4.77614237,0 5,0.223857625 5,0.5 L5,2.75 C5,3.02614237 4.77614237,3.25 4.5,3.25 C4.22385763,3.25 4,3.02614237 4,2.75 L4,0.5 Z M8,0.5 C8,0.223857625 8.22385763,0 8.5,0 C8.77614237,0 9,0.223857625 9,0.5 L9,2.75 C9,3.02614237 8.77614237,3.25 8.5,3.25 C8.22385763,3.25 8,3.02614237 8,2.75 L8,0.5 Z M12,0.5 C12,0.223857625 12.2238576,0 12.5,0 C12.7761424,0 13,0.223857625 13,0.5 L13,2.75 C13,3.02614237 12.7761424,3.25 12.5,3.25 C12.2238576,3.25 12,3.02614237 12,2.75 L12,0.5 Z"
        id="合并形状"
        fill="#B2B2B2"
        fillRule="nonzero"
      ></path>
      <path
        d="M5.5,9.5 C4.94771525,9.5 4.5,9.05228475 4.5,8.5 C4.5,7.94771525 4.94771525,7.5 5.5,7.5 C6.05228475,7.5 6.5,7.94771525 6.5,8.5 C6.5,9.05228475 6.05228475,9.5 5.5,9.5 Z"
        id="椭圆形"
        fill="#979797"
        fillRule="nonzero"
      ></path>
      <path
        d="M5.5,13.5 C4.94771525,13.5 4.5,13.0522847 4.5,12.5 C4.5,11.9477153 4.94771525,11.5 5.5,11.5 C6.05228475,11.5 6.5,11.9477153 6.5,12.5 C6.5,13.0522847 6.05228475,13.5 5.5,13.5 Z"
        id="椭圆形-copy-2"
        fill="#979797"
        fillRule="nonzero"
      ></path>
      <path
        d="M10.5,9.5 C9.94771525,9.5 9.5,9.05228475 9.5,8.5 C9.5,7.94771525 9.94771525,7.5 10.5,7.5 C11.0522847,7.5 11.5,7.94771525 11.5,8.5 C11.5,9.05228475 11.0522847,9.5 10.5,9.5 Z"
        id="椭圆形-copy"
        fill="#979797"
        fillRule="nonzero"
      ></path>
      <path
        d="M10.5,13.5 C9.94771525,13.5 9.5,13.0522847 9.5,12.5 C9.5,11.9477153 9.94771525,11.5 10.5,11.5 C11.0522847,11.5 11.5,11.9477153 11.5,12.5 C11.5,13.0522847 11.0522847,13.5 10.5,13.5 Z"
        id="椭圆形-copy-3"
        fill="#979797"
        fillRule="nonzero"
      ></path>
      <rect
        id="矩形"
        stroke="#BDBDBD"
        fillRule="nonzero"
        x="1.5"
        y="5.5"
        width="13"
        height="1"
      ></rect>
    </g>
  </svg>
);

const CharSvg = () => (
  <svg viewBox="0 0 16 16" width="16px" height="16px">
    <g id="icon/16/Char" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <rect
        id="矩形"
        stroke="currentColor"
        fillRule="nonzero"
        x="0.5"
        y="1.5"
        width="15"
        height="14"
        rx="2"
      ></rect>
      <path
        d="M4,0.5 C4,0.223857625 4.22385763,0 4.5,0 C4.77614237,0 5,0.223857625 5,0.5 L5,2.75 C5,3.02614237 4.77614237,3.25 4.5,3.25 C4.22385763,3.25 4,3.02614237 4,2.75 L4,0.5 Z M8,0.5 C8,0.223857625 8.22385763,0 8.5,0 C8.77614237,0 9,0.223857625 9,0.5 L9,2.75 C9,3.02614237 8.77614237,3.25 8.5,3.25 C8.22385763,3.25 8,3.02614237 8,2.75 L8,0.5 Z M12,0.5 C12,0.223857625 12.2238576,0 12.5,0 C12.7761424,0 13,0.223857625 13,0.5 L13,2.75 C13,3.02614237 12.7761424,3.25 12.5,3.25 C12.2238576,3.25 12,3.02614237 12,2.75 L12,0.5 Z"
        id="合并形状"
        fill="#B2B2B2"
        fillRule="nonzero"
      ></path>
      <text
        id="A"
        fontFamily="PingFangSC-Medium, PingFang SC"
        fontSize="9"
        fontWeight="400"
        fill="#666666"
      >
        <tspan x="3.467" y="12">
          A
        </tspan>
      </text>
      <text
        id="a"
        fontFamily="PingFangSC-Medium, PingFang SC"
        fontSize="6"
        fontWeight="400"
        fill="#666666"
      >
        <tspan x="10.293" y="12">
          a
        </tspan>
      </text>
    </g>
  </svg>
);

const SortDownSvg = () => (
  <svg viewBox="0 0 16 16" width="16px" height="16px">
    <g id="08图标12/排序--copy" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <rect
        id="矩形"
        fill="currentColor"
        fillRule="nonzero"
        x="0"
        y="0"
        width="12"
        height="12"
        rx="2"
      ></rect>
      <path
        d="M5.5,4.1822983 L4.10650661,5.1578103 C3.94357352,5.27187125 3.70784743,5.24649798 3.57999766,5.10113751 C3.45214788,4.95577703 3.48058853,4.74547442 3.64352162,4.63141346 L5.55590682,3.29265238 C5.58039851,3.27550703 5.6057258,3.26044585 5.63167812,3.24743168 C5.79464266,3.06954352 6.06717829,3.03117709 6.27508637,3.16815721 L8.35647838,4.53948104 C8.51941147,4.64682941 8.54785212,4.84475553 8.42000234,4.98156141 C8.29215257,5.11836729 8.05642648,5.14224733 7.89349339,5.03489896 L6.5,4.11679671 L6.5,8.67237351 C6.5,8.85714247 6.33210768,9.00692731 6.12500202,9.00692731 C6.08038327,9.00692731 6.03758459,8.99997517 5.99789267,8.98721883 C5.95939176,8.99842735 5.91804179,9.0045166 5.87499798,9.0045166 C5.66789232,9.0045166 5.5,8.86354674 5.5,8.68965159 L5.5,4.1822983 Z"
        id="合并形状"
        fill="#FFFFFF"
        fillRule="nonzero"
        transform="translate(6.000000, 6.046277) scale(1, -1) translate(-6.000000, -6.046277) "
      ></path>
    </g>
  </svg>
);

const SortUpSvg = () => (
  <svg viewBox="0 0 16 16" width="16px" height="16px">
    <g id="08图标12/排序-" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <rect
        id="矩形"
        fill="currentColor"
        fillRule="nonzero"
        x="0"
        y="0"
        width="12"
        height="12"
        rx="2"
      ></rect>
      <path
        d="M5.5,4.1822983 L4.10650661,5.1578103 C3.94357352,5.27187125 3.70784743,5.24649798 3.57999766,5.10113751 C3.45214788,4.95577703 3.48058853,4.74547442 3.64352162,4.63141346 L5.55590682,3.29265238 C5.58039851,3.27550703 5.6057258,3.26044585 5.63167812,3.24743168 C5.79464266,3.06954352 6.06717829,3.03117709 6.27508637,3.16815721 L8.35647838,4.53948104 C8.51941147,4.64682941 8.54785212,4.84475553 8.42000234,4.98156141 C8.29215257,5.11836729 8.05642648,5.14224733 7.89349339,5.03489896 L6.5,4.11679671 L6.5,8.67237351 C6.5,8.85714247 6.33210768,9.00692731 6.12500202,9.00692731 C6.08038327,9.00692731 6.03758459,8.99997517 5.99789267,8.98721883 C5.95939176,8.99842735 5.91804179,9.0045166 5.87499798,9.0045166 C5.66789232,9.0045166 5.5,8.86354674 5.5,8.68965159 L5.5,4.1822983 Z"
        id="合并形状"
        fill="currentColor"
        fillRule="nonzero"
      ></path>
    </g>
  </svg>
);

const FilterSvg = () => (
  <svg viewBox="0 0 16 16" width="16px" height="16px">
    <g id="08图标12/筛选-完成" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
      <rect
        id="矩形"
        fill="currentColor"
        fillRule="nonzero"
        x="0"
        y="0"
        width="12"
        height="12"
        rx="2"
      ></rect>
      <polyline
        id="路径-38"
        stroke="#FFFFFF"
        strokeWidth="0.6"
        stroke-linecap="round"
        stroke-linejoin="round"
        fillRule="nonzero"
        points="4.875 8.92500334 4.875 5.25246422 3 3 9 3 7.125 5.25246422 7.125 6.57444149"
      ></polyline>
      <polyline
        id="路径-39"
        stroke="#FFFFFF"
        strokeWidth="0.6"
        stroke-linecap="round"
        fillRule="nonzero"
        points="7 7.98004633 8 9.0045166 10 7"
      ></polyline>
    </g>
  </svg>
);

export { CalculatorSvg, CalendarSvg, CharSvg, SortDownSvg, SortUpSvg, FilterSvg };
